@extends('layouts.app')

@section('content')
    <div class="card">
        <div class="card-body">
            <div class="container">
                <h5 class="text-center">นโยบายการคุ้มครองข้อมูลส่วนบุคคล (Privacy Policy)</h5>
                <div class="indent">
                    ระบบสารสนเทศเพื่อคัดกรองนักศึกษาที่มีสิทธิ์เข้าพักในหอพักส่วนกลาง มหาวิทยาลัยขอนแก่น
                    (“หอพักส่วนกลาง”) ตระหนักถึงความสำคัญของข้อมูลส่วนบุคคล (“ท่าน”)
                </div>
                <div class="indent">
                    ดังนั้น หอพักส่วนกลางจึงกำหนดนโยบาย ระเบียบ และหลักเกณฑ์ต่าง ๆ
                    ในการดำเนินงานในการรักษาความปลอดภัยของข้อมูลส่วนบุคคล
                    เพื่อให้ท่านได้มั่นใจว่าข้อมูลส่วนบุคคลของท่านถูกนำไปใช้ตรงตามความต้องการของท่านและถูกต้องตามกฎหมาย
                </div>
                <strong>1. นโยบายฉบับนี้มีขึ้นเพื่ออะไร</strong>
                <div class="indent">
                    นโยบายฉบับนี้ใช้เพื่อแจ้งให้ท่านในฐานะเจ้าของข้อมูลส่วนบุคคลทราบถึงวัตถุประสงค์และรายละเอียดของการเก็บรวบรวม
                    ใช้ และ/หรือเปิดเผยข้อมูลส่วนบุคคล ตลอดจนสิทธิตามกฎหมายของท่านที่เกี่ยวข้องกับข้อมูลส่วนบุคคล
                </div>
                <strong>2. ข้อมูลส่วนบุคคลอะไรบ้างที่หอพักส่วนกลางเก็บรวบรวม</strong>
                <div class="indent">
                    ข้อมูลส่วนบุคคล คือ ข้อมูลที่ทำให้สามารถระบุตัวตนของท่านได้ ไม่ว่าทางตรงหรือทางอ้อม
                    ซึ่งข้อมูลส่วนบุคคลที่ท่านให้ไว้แก่หอพักส่วนกลางเพื่อจัดเก็บ มีดังต่อไปนี้
                </div>
                <table class="table table-sm table-bordered">
                    <thead>
                        <tr class="text-center">
                            <th>ประเภทข้อมูล</th>
                            <th>ข้อมูลส่วนบุคคลของสมาชิกในหอพัก</th>
                        </tr>
                    </thead>
                    <tbody>
                        <tr>
                            <td>รายละเอียดส่วนบุคคล</td>
                            <td>
                                1) คำนำหน้า <br>
                                2) ชื่อ-นามสกุลของท่าน บิดา มารดา และผู้อุปการะ(ถ้ามีผู้อุปการะ) <br>
                                3) นามแฝงของท่าน<br>
                                4) วันเดือนปีเกิดของท่าน<br>
                                5) อายุของท่าน บิดา มารดา และผู้อุปการะ(ถ้ามีผู้อุปการะ)<br>
                                6) ข้อมูลการศึกษาของท่าน<br>
                                7) ข้อมูลสุขภาพของท่าน<br>
                                8) สถานภาพสมรสของบิดามารดา<br>
                                9) สถานภาพของบิดามารดา(มีชีวิต/ไม่มีชีวิต)<br>
                                10) ข้อมูลพี่น้องร่วมบิดามารดา<br>
                                11) ความเกี่ยวข้องของผู้อุปการะ(ถ้ามีผู้อุปการะ)
                            </td>
                        </tr>
                        <tr>
                            <td>รายละเอียดการติดต่อ</td>
                            <td>
                                1) ที่อยู่ของท่าน บิดา มารดา และผู้อุปการะ(ถ้ามีผู้อุปการะ)<br>
                                2) ที่อยู่อิเล็กทรอนิกส์ของท่าน (E-mail)<br>
                                3) หมายเลขโทรศัพท์ของท่าน บิดา มารดา และผู้อุปการะ(ถ้ามีผู้อุปการะ)<br>

                            </td>
                        </tr>
                        <tr>
                            <td>รายละเอียดการทำงาน</td>
                            <td>
                                1) อาชีพของบิดา มารดา และผู้อุปการะ(ถ้ามีผู้อุปการะ)<br>
                                2) เงินเดือนของบิดา มารดา และผู้อุปการะ(ถ้ามีผู้อุปการะ)<br>

                            </td>
                        </tr>
                        <tr>
                            <td>ข้อมูลเกี่ยวกับการรักษาความปลอดภัย</td>
                            <td>รูปภาพของท่าน</td>
                        </tr>
                        <tr>
                            <td>ข้อมูลอื่น ๆ</td>
                            <td>ข้อมูลอื่น ๆ ข้อมูลที่ท่านให้ไว้กับหอพักส่วนกลางไม่ว่าผ่านช่องทางใด ๆ</td>
                        </tr>
                    </tbody>
                </table>
                <strong>3. หอพักส่วนกลาง ใช้ข้อมูลส่วนบุคคลของท่านให้กับใคร เพื่อวัตถุประสงค์ใดบ้าง</strong>
                <div class="indent">
                    3.1 สำหรับข้อมูลการสมัครสมาชิก ใช้ในการจัดเก็บคะแนนการเข้าร่วมกิจกรรมของท่าน
                    โดยคณะกรรมการหอพักจะนำข้อมูลส่วนบุคคลของท่านไประบุตัวตนของท่าน
                    เพื่อให้สามารถให้คะแนนดังกล่าวได้อย่างถูกต้อง
                </div>
                <div class="indent">
                    3.2 สำหรับข้อมูลใบสมัคร จะนำไปใช้ในการพิจารณาการสัมภาษณ์ของท่าน โดยอาจารย์ประจำหอพัก
                    และหัวหน้าหน่วยบริการหอพัก จะนำข้อมูลส่วนบุคคลของท่านไปใช้ เพื่อประกอบในการดำเนินการดังกล่าวได้
                </div>
                <div class="indent">
                    3.3 การดำเนินการเหตุเหล่านี้หอพักส่วนกลางจำเป็นต้องได้รับความยินยอมของท่าน
                </div>
                <strong>4. หอพักส่วนกลางจัดเก็บข้อมูลส่วนบุคคลของท่านไว้นานเท่าใด</strong>
                <div class="indent">
                    หอพักส่วนกลางจะเก็บรักษาข้อมูลส่วนบุคคลของท่านไว้จนถึงระยะเวลาสำเร็จการศึกษาตามเกณฑ์ของมหาวิทยาลัยหรือตามระยะเวลาที่จำเป็น
                    เพื่อให้บรรลุวัตถุประสงค์ที่เกี่ยวข้องในนโยบายฉบับนี้ จากนั้น
                    หอพักส่วนกลางจะลบหรือทำลายข้อมูลส่วนบุคคลของท่าน
                </div>
                <strong>5. หอพักส่วนกลางคุ้มครองข้อมูลส่วนบุคคลของท่านอย่างไร</strong>
                <div class="indent">
                    หอพักส่วนกลางจะเก็บรักษาข้อมูลส่วนบุคคลของท่านไว้เป็นอย่างดีตามมาตรการเชิงเทคนิค (Technical Measure)
                    และมาตรการเชิงบริหารจัดการ (Organizational Measure)
                    เพื่อรักษาความมั่นคงปลอดภัยในการประมวลผลข้อมูลส่วนบุคคลที่เหมาะสม
                    และเพื่อป้องกันการละเมิดข้อมูลส่วนบุคคล โดยหอพักส่วนกลางได้กำหนดนโยบาย ระเบียบ
                    และหลักเกณฑ์ในการคุ้มครองข้อมูลส่วนบุคคล โดยจะมีการกำหนดรหัสผู้ใช้งาน (User ID) และรหัสผ่าน (Password)
                    รวมทั้งมีการกำหนดมาตรการในการใช้ข้อมูลส่วนบุคคลของท่านให้เป็นไปตามวัตถุประสงค์
                    เฉพาะผู้ที่มีอำนาจเท่านั้น
                </div>
                <strong>6. สิทธิของท่านเกี่ยวกับข้อมูลส่วนบุคคลมีอะไรบ้าง</strong>
                <div class="indent">
                    ท่านสามารถขอใช้สิทธิต่าง ๆ ได้ภายใต้ข้อกำหนดของกฎหมาย
                    และนโยบายที่กำหนดไว้ในขณะนี้หรือที่จะมีการแก้ไขเพิ่มเติมในอนาคต
                    ตลอดจนหลักเกณฑ์ตามที่หอพักส่วนกลางกำหนดขึ้น ดังต่อไปนี้
                </div>
                <div class="indent">
                    6.1 สิทธิขอถอนความยินยอม :
                    ท่านมีสิทธิที่จะถอนความยินยอมเมื่อใดก็ได้ตลอดระยะเวลาที่ข้อมูลส่วนบุคคลของท่านอยู่กับหอพักส่วนกลาง
                    เว้นแต่มีข้อจำกัดสิทธินั้นโดยกฎหมาย
                </div>
                <div class="indent">6.2 สิทธิขอเข้าถึงข้อมูล :
                    ท่านมีสิทธิขอเข้าถึงข้อมูลส่วนบุคคลของท่านที่อยู่ในความรับผิดชอบของหอพักส่วนกลาง</div>
                <div class="indent">6.3 สิทธิขอให้ลบหรือทำลายข้อมูล : ท่านมีสิทธิขอลบหรือทำลายข้อมูลส่วนบุคคลของท่าน
                    หรือทำให้ข้อมูลส่วนบุคคลเป็นข้อมูลที่ไม่สามารถระบุตัวท่านได้</div>
                <div class="indent">6.4 สิทธิขอให้แก้ไขข้อมูล : ท่านมีสิทธิขอแก้ไขข้อมูลส่วนบุคคลของท่านให้ถูกต้อง
                    เป็นปัจจุบัน สมบูรณ์ และไม่ก่อให้เกิดความเข้าใจผิด</div>
                <div class="indent">6.5 การใช้สิทธิของท่านดังกล่าวข้างต้นอาจถูกจำกัดภายใต้กฎหมายที่เกี่ยวข้อง
                    และมีบางกรณีที่มีเหตุจำเป็นที่หอพักส่วนกลางอาจปฏิเสธหรือไม่สามารถดำเนินการตามคำขอใช้สิทธิข้างต้นของท่านได้
                    เช่น ต้องปฏิบัติตามกฎหมายหรือคำสั่งศาล เพื่อประโยชน์สาธารณะ
                    การใช้สิทธิอาจละเมิดสิทธิหรือเสรีภาพของบุคคลอื่น เป็นต้น หากหอพักส่วนกลางปฏิเสธ คำขอข้างต้น
                    หอพักส่วนกลางจะแจ้งเหตุผลของการปฏิเสธให้ท่านทราบด้วย</div>
                <strong>9. ท่านจะติดต่อหอพักส่วนกลาง ได้อย่างไร</strong>
                <div class="indent">
                    หากท่านมีข้อเสนอแนะ หรือต้องการสอบถามข้อมูลเกี่ยวกับรายละเอียดการเก็บรวบรวม ใช้
                    และ/หรือเปิดเผยข้อมูลส่วนบุคคลของท่าน รวมถึงการขอใช้สิทธิตามนโยบายฉบับนี้ ท่านสามารถติดต่อหอพักส่วนกลาง
                    ผ่านช่องทางดังนี้ ในวันและเวลาทำการของกองบริการหอพักนักศึกษามหาวิทยาลัยขอนแก่น (จันทร์ – ศุกร์ เวลา
                    08.30 – 16.30 น.) โทร 043-202841 หรือ 043-009700 ต่อ 42799 , 44822
                    สถานที่ติดต่อ : กองบริการหอพักนักศึกษา (หอพักส่วนกลาง) ที่อยู่ 123 หมู่ 16 ถ.มิตรภาพ ต.ในเมือง อ.เมือง
                    จ.ขอนแก่น 40002
                </div>
                <div class="row justify-content-center mt-4">
                    <a href="{{ $previousRoute }}" class="btn btn-light mr-2">ไม่ตกลง</a>
                    <a href="{{ $nextRoute }}" class="btn btn-primary">ตกลง</a>
                </div>
            </div>
        </div>
    </div>
@endsection

@push('scripts')
    <style>
        div.indent {
            text-indent: 1.5rem;
        }

    </style>
@endpush
